Allrun
#!/bin/sh
blockMesh

#interFoam
decomposePar

mpirun -np 4 interFoam -parallel
#------------------------------------------------------------------------------
